Docs/Notes.org
Before you begin reading, there are some things you should know.

   
* Shape types

#+begin_src C
  struct PolygonProperties {
    int vertexCount;
    vec2* vertices;
    bool isConvex;
  };

  struct S_Rect {
    vec2 origin;
    float width, height;
    // The corners of the rectangle, factoring rotations
    vec2 topLeft, topRight, bottomLeft, bottomRight;
    // The corners of the rectangle, not factoring rotations
    vec2 ut_topLeft, ut_topRight, ut_bottomLeft, ut_bottomRight;
    // The angle of the rectangle (in radians)
    float angle;
    float diagonal;
    PolygonProperties polyProperties;
  };

  struct S_Circle {
    vec2 origin;
    float radius;
  };
#+end_src

* Rotating vectors


* Finding the corners of a rectangle.

So we want to find the corners of a rectangle. We have the origin, the length and the width. When we have an unrotated rectangle, we can easily find the corners.

Let:
- W (width) H (height)
- A (Top left corner) = (-W/2, H/2)
- B (Top right corner) = (W/2, H/2)
- C (Bottom left corner) = (-W/2, -H/2)
- D (Bottom right corner) = (W/2, -H/2)

Now if we have an angle \Theta on our rectangle, this won't work. So what can we do? Well you might think to just rotate all the points. And this works perfectly fine. We can calculate cos(\Theta) and sin(\Theta) once, reuse them for every corner, and get good enough results. However, there is a better method. 

Lets look at two important properties of a rectangle.
- The opposite sides are parallel to eachother
- The interior angle of each corner is 90°.

The components of the right angle corner are A, O, and R.
Where:
- A is the adjacent vector
- O is the opposite vector
- R is the sum of A and O

O will form a right angle from A. So all we need to do is get A, the point 90° from A.

#+begin_center
- O = (-A_{y}, A_{x})
#+end_center
#+begin_comment
Tip: If you want to get the left angle, don't neg A_{y}
#+end_comment

So if \Theta = 0, then

- A = (cos\Theta, sin\Theta) = (1, 0)
- O = (-A_{y}, A_{x}) = (0, 1)
- R = A + O = (1, 1)

Now that we have A and O we can use them for every corner. If you want the bottom left, just do -R, and if you want the bottom right do (-A) - O. Lets look at the full equation to get all corners.

Let:
- A = (cos\Theta, sin\Theta) * (W/2)
- O = (-A_{y}, A_{x}) * (H/2)
- C_{1} (Top right)    =   A + O
- C_{2} (Top left)     = (-A) + O
- C_{3} (Bottom left)  =  -C_{1}
- C_{4} (Bottom right) =   -C_{2}

This is how the function would look in Luau

#+begin_src lua
  local function GetAARectCorners(width: number, height: number, origin: Vector2): (Vector2, Vector2, Vector2, Vector2)
  	local half_width = width/2
  	local half_height = height/2
  	local tr, br =
  		Vector2.new(half_width, half_height),
  		Vector2.new(half_width, -half_height)
  	-- We can just use the opposite of the vectors.
  	return -br + origin , tr + origin, -tr + origin, br + origin
  end

  local function GetRectCorners(width: number, height: number, angle: number, origin: Vector2): (Vector2, Vector2, Vector2, Vector2)
    	local cos, sin = math.cos(angle), math.sin(angle)
    	local adjacent  = Vector2.new(cos, sin) * (width/2)
    	local opposite = Vector2.new(-sin, cos) * (height/2)

    	local C1 = adjacent + opposite
    	local C2 = -adjacent + opposite
    	
    	return
    		origin + C1,
    		origin + C2,
    		origin - C1,
    		origin - C2
  end
#+end_src

* Colisions and intersections
