Docs/Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-10-23 Thu 00:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Joe" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb705df2">1. Shape types</a></li>
<li><a href="#org131dd8c">2. Rotating vectors</a></li>
<li><a href="#org70be3c0">3. Finding the corners of a rectangle.</a></li>
<li><a href="#orgba7df83">4. Colisions and intersections</a>
<ul>
<li><a href="#org07e42a1">4.1. Line segment intersections</a></li>
<li><a href="#org9499541">4.2. (Axis Aligned) Rectangle collisions</a>
<ul>
<li><a href="#org87b9a20">4.2.1. Point in rectangle</a></li>
<li><a href="#org4311d81">4.2.2. Line in rectangle</a></li>
<li><a href="#orgbb16720">4.2.3. Rectangle in rectangle</a></li>
</ul>
</li>
<li><a href="#org3a1f340">4.3. (Orientated) Rectangle collisions</a>
<ul>
<li><a href="#org6b46369">4.3.1. Point in rectangle</a></li>
<li><a href="#orgd26c2d8">4.3.2. Line in rectangle</a></li>
<li><a href="#org6540b5a">4.3.3. SAT (Seperating Axis Theorem)</a></li>
<li><a href="#org6ef89c6">4.3.4. What is SAT</a></li>
<li><a href="#org3adc50e">4.3.5. Implementing SAT</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org848c832">5. Collisions accross shapes</a></li>
</ul>
</div>
</div>
<p>
Before you begin reading, there are some things you should know.
</p>
<div id="outline-container-orgb705df2" class="outline-2">
<h2 id="orgb705df2"><span class="section-number-2">1.</span> Shape types</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #0000FF; font-weight: bold;">struct</span> <span style="color: #6434A3;">PolygonProperties</span> {
  <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">vertexCount</span>;
  <span style="color: #6434A3;">vec2</span>* <span style="color: #BA36A5;">vertices</span>;
  <span style="color: #6434A3;">bool</span> <span style="color: #BA36A5;">isConvex</span>;
};

<span style="color: #0000FF; font-weight: bold;">struct</span> <span style="color: #6434A3;">S_Rect</span> {
  <span style="color: #6434A3;">vec2</span> <span style="color: #BA36A5;">origin</span>;
  <span style="color: #6434A3;">float</span> <span style="color: #BA36A5;">width</span>, <span style="color: #BA36A5;">height</span>;
  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">The corners of the rectangle, factoring rotations
</span>  <span style="color: #6434A3;">vec2</span> <span style="color: #BA36A5;">topLeft</span>, <span style="color: #BA36A5;">topRight</span>, <span style="color: #BA36A5;">bottomLeft</span>, <span style="color: #BA36A5;">bottomRight</span>;
  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">The corners of the rectangle, not factoring rotations
</span>  <span style="color: #6434A3;">vec2</span> <span style="color: #BA36A5;">ut_topLeft</span>, <span style="color: #BA36A5;">ut_topRight</span>, <span style="color: #BA36A5;">ut_bottomLeft</span>, <span style="color: #BA36A5;">ut_bottomRight</span>;
  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">The angle of the rectangle (in radians)
</span>  <span style="color: #6434A3;">float</span> <span style="color: #BA36A5;">angle</span>;
  <span style="color: #6434A3;">float</span> <span style="color: #BA36A5;">diagonal</span>;
  <span style="color: #6434A3;">PolygonProperties</span> <span style="color: #BA36A5;">polyProperties</span>;
};

<span style="color: #0000FF; font-weight: bold;">struct</span> <span style="color: #6434A3;">S_Circle</span> {
  <span style="color: #6434A3;">vec2</span> <span style="color: #BA36A5;">origin</span>;
  <span style="color: #6434A3;">float</span> <span style="color: #BA36A5;">radius</span>;
};
</pre>
</div>
</div>
</div>
<div id="outline-container-org131dd8c" class="outline-2">
<h2 id="org131dd8c"><span class="section-number-2">2.</span> Rotating vectors</h2>
</div>


<div id="outline-container-org70be3c0" class="outline-2">
<h2 id="org70be3c0"><span class="section-number-2">3.</span> Finding the corners of a rectangle.</h2>
<div class="outline-text-2" id="text-3">
<p>
So we want to find the corners of a rectangle. We have the origin, the length and the width. When we have an unrotated rectangle, we can easily find the corners.
</p>

<p>
Let:
</p>
<ul class="org-ul">
<li>W (width) H (height)</li>
<li>A (Top left corner) = (-W/2, H/2)</li>
<li>B (Top right corner) = (W/2, H/2)</li>
<li>C (Bottom left corner) = (-W/2, -H/2)</li>
<li>D (Bottom right corner) = (W/2, -H/2)</li>
</ul>

<p>
Now if we have an angle &Theta; on our rectangle, this won't work. So what can we do? Well you might think to just rotate all the points. And this works perfectly fine. We can calculate cos(&Theta;) and sin(&Theta;) once, reuse them for every corner, and get good enough results. However, there is a better method. 
</p>

<p>
Lets look at two important properties of a rectangle.
</p>
<ul class="org-ul">
<li>The opposite sides are parallel to eachother</li>
<li>The interior angle of each corner is 90°.</li>
</ul>

<p>
The components of the right angle corner are A, O, and R.
Where:
</p>
<ul class="org-ul">
<li>A is the adjacent vector</li>
<li>O is the opposite vector</li>
<li>R is the sum of A and O</li>
</ul>

<p>
O will form a right angle from A. So all we need to do is get A, the point 90° from A.
</p>

<div class="org-center">
<ul class="org-ul">
<li>O = (-A<sub>y</sub>, A<sub>x</sub>)</li>
</ul>
</div>

<p>
So if &Theta; = 0, then
</p>

<ul class="org-ul">
<li>A = (cos&Theta;, sin&Theta;) = (1, 0)</li>
<li>O = (-A<sub>y</sub>, A<sub>x</sub>) = (0, 1)</li>
<li>R = A + O = (1, 1)</li>
</ul>

<p>
Now that we have A and O we can use them for every corner. If you want the bottom left, just do -R, and if you want the bottom right do (-A) - O. Lets look at the full equation to get all corners.
</p>

<p>
Let:
</p>
<ul class="org-ul">
<li>A = (cos&Theta;, sin&Theta;) * (W/2)</li>
<li>O = (-A<sub>y</sub>, A<sub>x</sub>) * (H/2)</li>
<li>C<sub>1</sub> (Top right)    =   A + O</li>
<li>C<sub>2</sub> (Top left)     = (-A) + O</li>
<li>C<sub>3</sub> (Bottom left)  =  -C<sub>1</sub></li>
<li>C<sub>4</sub> (Bottom right) =   -C<sub>2</sub></li>
</ul>

<p>
This is how the function would look in Luau
</p>

<div class="org-src-container">
<pre class="src src-lua"><span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #0000FF; font-weight: bold;">function</span> <span style="color: #006699;">GetAARectCorners</span>(<span style="color: #BA36A5;">width</span>: number, height: number, origin: Vector2): (Vector2, Vector2, Vector2, Vector2)
    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">half_width</span> = width/2
    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">half_height</span> = height/2
    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">tr</span>, <span style="color: #BA36A5;">br</span> =
        Vector2.new(half_width, half_height),
        Vector2.new(half_width, -half_height)
    <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">We can just use the opposite of the vectors.
</span>    <span style="color: #0000FF; font-weight: bold;">return</span> -br + origin , tr + origin, -tr + origin, br + origin
<span style="color: #0000FF; font-weight: bold;">end</span>

<span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #0000FF; font-weight: bold;">function</span> <span style="color: #006699;">GetRectCorners</span>(<span style="color: #BA36A5;">width</span>: number, height: number, angle: number, origin: Vector2): (Vector2, Vector2, Vector2, Vector2)
    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">cos</span>, <span style="color: #BA36A5;">sin</span> = <span style="color: #006FE0;">math</span>.<span style="color: #006FE0;">cos</span>(angle), <span style="color: #006FE0;">math</span>.<span style="color: #006FE0;">sin</span>(angle)
    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">adjacent</span>  = Vector2.new(cos, sin) * (width/2)
    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">opposite</span> = Vector2.new(-sin, cos) * (height/2)

    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">C1</span> = adjacent + opposite
    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">C2</span> = -adjacent + opposite

    <span style="color: #0000FF; font-weight: bold;">return</span>
        origin + C1,
        origin + C2,
        origin - C1,
        origin - C2
<span style="color: #0000FF; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgba7df83" class="outline-2">
<h2 id="orgba7df83"><span class="section-number-2">4.</span> Colisions and intersections</h2>
<div class="outline-text-2" id="text-4">
</div>
