Docs/Notes.org
** Line segment intersections

What does it mean for two lines to intersect? Lets say we have a line L with the points {(1,0), (-1, 0)}. We want to check if these points cross Y axis. In order for that to happen, these points must be on opposite sides of the y-axis. Basically, one point needs to be on the left side, and the other on the right, If they are on the same side, they cannot cross each other. In this case, the line L does cross the y-axis because they are on opposite sides. We also know the y-axis crosses the L because it is infinite, so L and the y-axis intersect each other.

We have a line segment L_{1}, and a y-axis aligned line-segment L_{2}.

Let:
- L_{1} = {p_{1}, p_{2}}
- L_{2} = {p_{3}, p_{4}}

We need to check if the points in L_{2} are on the on the left and right of L_{1}. We can use the cross product of two 2D vectors to determine this. The cross product of two 2D vectors, A and B, return a signed scalar value. We can use this signed value to detect if B is clockwise (right) or counterclockwise (left) from A.

The cross product two 2D vectors is defined as:
#+begin_center
Cross(P_{1}, P_{2}) = P_{1}.x * P_{2}.y - P_{1}.y * P_{2}.x
#+end_center

So the function to find if L_{2} crosses L_{1} is:
#+begin_center
Cross(p_{2} - p_{1}, p_{3} - p_{1}) > 0
~=
Cross(p_{2} - p_{1}, p_{4} - p_{1}) > 0
#+end_center

We subtract p_{1} from the values so they have a common origin. If they are AA or BB, it means they are on the same side, therefore they do not cross. If they are AB or BA, they are different, therefore they do cross.

Now we need to check the other way, if the points in L_{1} are on the on the left and right of L_{2}. Since L_{2} is y-axis aligned, we can just check if the x components of p_{1} and p_{2} are on the left and right of x of. It doesn't even matter which x we use from p_{3} or p_{4} in this case, since they are both the same.

#+begin_center
p_{1}.x < p_{3}.x
~=
p_{2}.x < p_{3}.x
#+end_center

If we wanted to check the same for an x-axis aligned line-segment, we just swap the x values for y.

Lets look at how we would implement these functions in Luau:

#+begin_src lua
  local function LineIntersectsXAALine(p1: Vector2, p2: Vector2, p3: Vector2, p4: Vector2): boolean
  	local fixed_p2 = p2 - p1 
      return
  		-- L₂ crosses L₁
  		fixed_p2:Cross(p3 - p1) > 0
  		~=
  		fixed_p2:Cross(p4 - p1) > 0
  		and
  		-- L₁ crosses L₂
  		p1.y > p4.y
  		~=
  		p2.y > p4.y
  end

  local function LineIntersectsYAALine(p1: Vector2, p2: Vector2, p3: Vector2, p4: Vector2): boolean
  	local fixed_p2 = p2 - p1 
      return
  		-- L₂ crosses L₁
  		fixed_p2:Cross(p3 - p1) > 0
  		~=
  		fixed_p2:Cross(p4 - p1) > 0
  		and
  		-- L₁ crosses L₂
  		p1.x > p4.x
  		~=
  		p2.x > p4.x
  end

  local function LineIntersectsLine(p1: Vector2, p2: Vector2, p3: Vector2, p4: Vector2): boolean
  	local fixed_p2 = p2 - p1
  	local fixed_p4 = p4 - p3
      return
  		-- L₁ crosses L₂
  		fixed_p2:Cross(p3 - p1) > 0
  		~=
  		fixed_p2:Cross(p4 - p1) > 0
  		and
  		-- L₂ crosses L₁
  		fixed_p4:Cross(p1 - p3) > 0
  		~=
  		fixed_p4:Cross(p2 - p3) > 0
  end
#+end_src

** (Axis Aligned) Rectangle collisions

This section will cover 3 types of rectangle collisions.

1. Point in rectangle
2. Line in rectangle
3. Rectangle in rectangle

*** Point in rectangle
   
The space to query in a unrotated rectangle is X_{min} X_{max},  and Y_{min} Y_{max}.

To test if a point is within a unrotated rectangle:

P_{x} > X_{min}
and
P_{x} < X_{max}
and
P_{y} > Y_{min}
and
P_{y} < Y_{max}

Where
- X_{min} is the x value of any point on the left side.
- X_{max} is the x value of any point on the right side.
- Y_{min} is the y value of any point on the bottom side.
- Y_{max} is the y value of any point on the top side.

In Luau:
#+begin_src lua
  local function QueryPointInAARect(point: Vector2, rect: S_Rect): boolean
  	local tl = rect.topLeft
  	local br = rect.bottomRight
  	return 
  		point.X > tl.X
  		and point.X < br.X
  		and point.Y > br.Y
  		and point.Y < tl.Y
  end
#+end_src

