Docs/Notes.html
<div id="outline-container-org07e42a1" class="outline-3">
<h3 id="org07e42a1"><span class="section-number-3">4.1.</span> Line segment intersections</h3>
<div class="outline-text-3" id="text-4-1">
<p>
What does it mean for two lines to intersect? Lets say we have a line L with the points {(1,0), (-1, 0)}. We want to check if these points cross Y axis. In order for that to happen, these points must be on opposite sides of the y-axis. Basically, one point needs to be on the left side, and the other on the right, If they are on the same side, they cannot cross each other. In this case, the line L does cross the y-axis because they are on opposite sides. We also know the y-axis crosses the L because it is infinite, so L and the y-axis intersect each other.
</p>

<p>
We have a line segment L<sub>1</sub>, and a y-axis aligned line-segment L<sub>2</sub>.
</p>

<p>
Let:
</p>
<ul class="org-ul">
<li>L<sub>1</sub> = {p<sub>1</sub>, p<sub>2</sub>}</li>
<li>L<sub>2</sub> = {p<sub>3</sub>, p<sub>4</sub>}</li>
</ul>

<p>
We need to check if the points in L<sub>2</sub> are on the on the left and right of L<sub>1</sub>. We can use the cross product of two 2D vectors to determine this. The cross product of two 2D vectors, A and B, return a signed scalar value. We can use this signed value to detect if B is clockwise (right) or counterclockwise (left) from A.
</p>

<p>
The cross product two 2D vectors is defined as:
</p>
<div class="org-center">
<p>
Cross(P<sub>1</sub>, P<sub>2</sub>) = P<sub>1</sub>.x * P<sub>2</sub>.y - P<sub>1</sub>.y * P<sub>2</sub>.x
</p>
</div>

<p>
So the function to find if L<sub>2</sub> crosses L<sub>1</sub> is:
</p>
<div class="org-center">
<p>
Cross(p<sub>2</sub> - p<sub>1</sub>, p<sub>3</sub> - p<sub>1</sub>) &gt; 0
~=
Cross(p<sub>2</sub> - p<sub>1</sub>, p<sub>4</sub> - p<sub>1</sub>) &gt; 0
</p>
</div>

<p>
We subtract p<sub>1</sub> from the values so they have a common origin. If they are AA or BB, it means they are on the same side, therefore they do not cross. If they are AB or BA, they are different, therefore they do cross.
</p>

<p>
Now we need to check the other way, if the points in L<sub>1</sub> are on the on the left and right of L<sub>2</sub>. Since L<sub>2</sub> is y-axis aligned, we can just check if the x components of p<sub>1</sub> and p<sub>2</sub> are on the left and right of x of. It doesn't even matter which x we use from p<sub>3</sub> or p<sub>4</sub> in this case, since they are both the same.
</p>

<div class="org-center">
<p>
p<sub>1</sub>.x &lt; p<sub>3</sub>.x
~=
p<sub>2</sub>.x &lt; p<sub>3</sub>.x
</p>
</div>

<p>
If we wanted to check the same for an x-axis aligned line-segment, we just swap the x values for y.
</p>

<p>
Lets look at how we would implement these functions in Luau:
</p>

<div class="org-src-container">
<pre class="src src-lua"><span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #0000FF; font-weight: bold;">function</span> <span style="color: #006699;">LineIntersectsXAALine</span>(<span style="color: #BA36A5;">p1</span>: Vector2, p2: Vector2, p3: Vector2, p4: Vector2): boolean
    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">fixed_p2</span> = p2 - p1 
    <span style="color: #0000FF; font-weight: bold;">return</span>
        <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">L&#8322; crosses L&#8321;
</span>        fixed_p2:Cross(p3 - p1) &gt; 0
        ~=
        fixed_p2:Cross(p4 - p1) &gt; 0
        <span style="color: #0000FF; font-weight: bold;">and</span>
        <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">L&#8321; crosses L&#8322;
</span>        p1.y &gt; p4.y
        ~=
        p2.y &gt; p4.y
<span style="color: #0000FF; font-weight: bold;">end</span>

<span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #0000FF; font-weight: bold;">function</span> <span style="color: #006699;">LineIntersectsYAALine</span>(<span style="color: #BA36A5;">p1</span>: Vector2, p2: Vector2, p3: Vector2, p4: Vector2): boolean
    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">fixed_p2</span> = p2 - p1 
    <span style="color: #0000FF; font-weight: bold;">return</span>
        <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">L&#8322; crosses L&#8321;
</span>        fixed_p2:Cross(p3 - p1) &gt; 0
        ~=
        fixed_p2:Cross(p4 - p1) &gt; 0
        <span style="color: #0000FF; font-weight: bold;">and</span>
        <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">L&#8321; crosses L&#8322;
</span>        p1.x &gt; p4.x
        ~=
        p2.x &gt; p4.x
<span style="color: #0000FF; font-weight: bold;">end</span>

<span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #0000FF; font-weight: bold;">function</span> <span style="color: #006699;">LineIntersectsLine</span>(<span style="color: #BA36A5;">p1</span>: Vector2, p2: Vector2, p3: Vector2, p4: Vector2): boolean
    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">fixed_p2</span> = p2 - p1
    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">fixed_p4</span> = p4 - p3
    <span style="color: #0000FF; font-weight: bold;">return</span>
        <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">L&#8321; crosses L&#8322;
</span>        fixed_p2:Cross(p3 - p1) &gt; 0
        ~=
        fixed_p2:Cross(p4 - p1) &gt; 0
        <span style="color: #0000FF; font-weight: bold;">and</span>
        <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">L&#8322; crosses L&#8321;
</span>        fixed_p4:Cross(p1 - p3) &gt; 0
        ~=
        fixed_p4:Cross(p2 - p3) &gt; 0
<span style="color: #0000FF; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9499541" class="outline-3">
<h3 id="org9499541"><span class="section-number-3">4.2.</span> (Axis Aligned) Rectangle collisions</h3>
<div class="outline-text-3" id="text-4-2">
<p>
This section will cover 3 types of rectangle collisions.
</p>

<ol class="org-ol">
<li>Point in rectangle</li>
<li>Line in rectangle</li>
<li>Rectangle in rectangle</li>
</ol>
</div>
<div id="outline-container-org87b9a20" class="outline-4">
<h4 id="org87b9a20"><span class="section-number-4">4.2.1.</span> Point in rectangle</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
The space to query in a unrotated rectangle is X<sub>min</sub> X<sub>max</sub>,  and Y<sub>min</sub> Y<sub>max</sub>.
</p>

<p>
To test if a point is within a unrotated rectangle:
</p>

<p>
P<sub>x</sub> &gt; X<sub>min</sub>
and
P<sub>x</sub> &lt; X<sub>max</sub>
and
P<sub>y</sub> &gt; Y<sub>min</sub>
and
P<sub>y</sub> &lt; Y<sub>max</sub>
</p>

<p>
Where
</p>
<ul class="org-ul">
<li>X<sub>min</sub> is the x value of any point on the left side.</li>
<li>X<sub>max</sub> is the x value of any point on the right side.</li>
<li>Y<sub>min</sub> is the y value of any point on the bottom side.</li>
<li>Y<sub>max</sub> is the y value of any point on the top side.</li>
</ul>

<p>
In Luau:
</p>
<div class="org-src-container">
<pre class="src src-lua"><span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #0000FF; font-weight: bold;">function</span> <span style="color: #006699;">QueryPointInAARect</span>(<span style="color: #BA36A5;">point</span>: Vector2, rect: S_Rect): boolean
    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">tl</span> = rect.topLeft
    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">br</span> = rect.bottomRight
    <span style="color: #0000FF; font-weight: bold;">return</span> 
        point.X &gt; tl.X
        <span style="color: #0000FF; font-weight: bold;">and</span> point.X &lt; br.X
        <span style="color: #0000FF; font-weight: bold;">and</span> point.Y &gt; br.Y
        <span style="color: #0000FF; font-weight: bold;">and</span> point.Y &lt; tl.Y
<span style="color: #0000FF; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
