Docs/Notes.org
*** Line in rectangle

There are two ways to be considered "colliding" with a rectangle.

1. Be within the space defined by the rectangle.
2. Intersect the space defined by the rectangle.
   
Two is important. If we have a cross (example figure below), where neither points are within the space of a rectangle, we can still have a collision.

Although there are two ways to collide, there may be times where you might only want to detect intersections, like with raycasts. But for this implementation, I will cover both.

For both of the collision cases, we already functions defined that we can reuse to make define function. For case 1, we can use QueryPointInAARect. And for case 2, because we know each line of the rectangle is axis aligned, we can use LineIntersects(X/Y)AALine.

In Luau:
#+begin_src lua
  local function QueryLineInAARect(p1: Vector2, p2: Vector2, rect: S_Rect): boolean
  	local tl = rect.topLeft
  	local tr = rect.topRight
  	local bl = rect.bottomLeft
  	local br = rect.bottomRight

  	return
  		-- Check if within the rect
  		QueryPointInURect(p1, rect)
  		or QueryPointInURect(p2, rect)
  	-- Check if intersect rect
  		or LinesIntersectsYAALine(p1, p2, tl, bl)
  		or LinesIntersectsYAALine(p1, p2, tr, br)
  		or LinesIntersectsXAALine(p1, p2, tl, tr)
  		or LinesIntersectsXAALine(p1, p2, bl, br)
  end
#+end_src

*** Rectangle in rectangle

We have two axis aligned rectangles, R_{1} and R_{2}. We know the space defined by these rectangles is between x_{min} x_{max}, and y_{min} y_{max}. To check if the space between the two rectangles overlap, we can check:

min_{1} < max_{2}
and
max_{1} > min_{2}

for the x and y axis of the min and max of R_{1} and R_{2}. If the min is past the max, it is too far right, and if the max is behind the min, then it is too far left.

#+begin_src lua
  local function QueryAARectInAARect(r1: S_Rect, r2: S_Rect): boolean
  	local tl1, br1 = r1.topLeft, r1.bottomRight
  	local tl2, br2 = r2.topLeft, r2.bottomRight
  	return
  		-- Check collision in x space
  		tl1.X < br2.X
  		and
  		br1.X > tl2.X
  		and
  		-- Check collision in y space
  		tl1.Y < br2.Y
  		and
  		br1.Y > tl2.Y
  end
#+end_src

** (Orientated) Rectangle collisions
*** Point in rectangle

This is actually pretty simple. Rather than dealing with a rotated rectangle, we can just rotate the point by the rectangle's angle.

#+begin_src lua
  local function QueryPointInRect(point: Vector2, rect: S_Rect): boolean
  	local rotated_point = RotatePointAroundPoint(point, rect.origin, rect.angle)
  	return QueryPointInAARect(rotated_point, rect)
  end
#+end_src

*** Line in rectangle

We use the same technique as Point in rectangle.

#+begin_src lua
  local function QueryLineInRect(p1: Vector2, p2: Vector2, rect: S_Rect)
  	local rotated_p1 = RotatePointAroundPoint(p1, rect.origin, rect.angle)
  	local rotated_p2 = RotatePointAroundPoint(p2, rect.origin, rect.angle)
  	return QueryLineInAARect(rotated_p1, rotated_p2, rect)
  end
#+end_src

*** SAT (Seperating Axis Theorem)

With AABB rectangle in rectangle collision, we checked, for each axis if:

#+begin_center
min_{1} < max_{2}
and
max_{1} > min_{2}
#+end_center

If this is true for both axes, there is a collision. In this section, we will take a closer look at its definition, and implementing it to even work with any convex polygon.

*** What is SAT
From [[https://en.wikipedia.org/wiki/Hyperplane_separation_theorem#Use_in_collision_detection][Wikipedia]]:
#+begin_quote
"Two closed convex objects are disjoint if there exists a line ("separating axis") onto which the two objects' projections are disjoint."
#+end_quote

This description "if there exists a line ("separating axis") onto which the two objects' projections are disjoint" may seem familiar. The entire time we have been using SAT. For example, with AABB- AABB collision, we "projected" the x values of our corners onto the x axis, and got the min and max from them. Well, we didn't actually do that in code. Because we already knew what point had the min and what point had the max.
