Docs/Notes.html
<div id="outline-container-org4311d81" class="outline-4">
<h4 id="org4311d81"><span class="section-number-4">4.2.2.</span> Line in rectangle</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
There are two ways to be considered "colliding" with a rectangle.
</p>

<ol class="org-ol">
<li>Be within the space defined by the rectangle.</li>
<li>Intersect the space defined by the rectangle.</li>
</ol>

<p>
Two is important. If we have a cross (example figure below), where neither points are within the space of a rectangle, we can still have a collision.
</p>

<p>
Although there are two ways to collide, there may be times where you might only want to detect intersections, like with raycasts. But for this implementation, I will cover both.
</p>

<p>
For both of the collision cases, we already functions defined that we can reuse to make define function. For case 1, we can use QueryPointInAARect. And for case 2, because we know each line of the rectangle is axis aligned, we can use LineIntersects(X/Y)AALine.
</p>

<p>
In Luau:
</p>
<div class="org-src-container">
<pre class="src src-lua"><span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #0000FF; font-weight: bold;">function</span> <span style="color: #006699;">QueryLineInAARect</span>(<span style="color: #BA36A5;">p1</span>: Vector2, p2: Vector2, rect: S_Rect): boolean
    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">tl</span> = rect.topLeft
    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">tr</span> = rect.topRight
    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">bl</span> = rect.bottomLeft
    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">br</span> = rect.bottomRight

    <span style="color: #0000FF; font-weight: bold;">return</span>
        <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">Check if within the rect
</span>        QueryPointInURect(p1, rect)
        <span style="color: #0000FF; font-weight: bold;">or</span> QueryPointInURect(p2, rect)
    <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">Check if intersect rect
</span>        <span style="color: #0000FF; font-weight: bold;">or</span> LinesIntersectsYAALine(p1, p2, tl, bl)
        <span style="color: #0000FF; font-weight: bold;">or</span> LinesIntersectsYAALine(p1, p2, tr, br)
        <span style="color: #0000FF; font-weight: bold;">or</span> LinesIntersectsXAALine(p1, p2, tl, tr)
        <span style="color: #0000FF; font-weight: bold;">or</span> LinesIntersectsXAALine(p1, p2, bl, br)
<span style="color: #0000FF; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbb16720" class="outline-4">
<h4 id="orgbb16720"><span class="section-number-4">4.2.3.</span> Rectangle in rectangle</h4>
<div class="outline-text-4" id="text-4-2-3">
<p>
We have two axis aligned rectangles, R<sub>1</sub> and R<sub>2</sub>. We know the space defined by these rectangles is between x<sub>min</sub> x<sub>max</sub>, and y<sub>min</sub> y<sub>max</sub>. To check if the space between the two rectangles overlap, we can check:
</p>

<p>
min<sub>1</sub> &lt; max<sub>2</sub>
and
max<sub>1</sub> &gt; min<sub>2</sub>
</p>

<p>
for the x and y axis of the min and max of R<sub>1</sub> and R<sub>2</sub>. If the min is past the max, it is too far right, and if the max is behind the min, then it is too far left.
</p>

<div class="org-src-container">
<pre class="src src-lua"><span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #0000FF; font-weight: bold;">function</span> <span style="color: #006699;">QueryAARectInAARect</span>(<span style="color: #BA36A5;">r1</span>: S_Rect, r2: S_Rect): boolean
    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">tl1</span>, <span style="color: #BA36A5;">br1</span> = r1.topLeft, r1.bottomRight
    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">tl2</span>, <span style="color: #BA36A5;">br2</span> = r2.topLeft, r2.bottomRight
    <span style="color: #0000FF; font-weight: bold;">return</span>
        <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">Check collision in x space
</span>        tl1.X &lt; br2.X
        <span style="color: #0000FF; font-weight: bold;">and</span>
        br1.X &gt; tl2.X
        <span style="color: #0000FF; font-weight: bold;">and</span>
        <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">Check collision in y space
</span>        tl1.Y &lt; br2.Y
        <span style="color: #0000FF; font-weight: bold;">and</span>
        br1.Y &gt; tl2.Y
<span style="color: #0000FF; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org3a1f340" class="outline-3">
<h3 id="org3a1f340"><span class="section-number-3">4.3.</span> (Orientated) Rectangle collisions</h3>
<div class="outline-text-3" id="text-4-3">
</div>
<div id="outline-container-org6b46369" class="outline-4">
<h4 id="org6b46369"><span class="section-number-4">4.3.1.</span> Point in rectangle</h4>
<div class="outline-text-4" id="text-4-3-1">
<p>
This is actually pretty simple. Rather than dealing with a rotated rectangle, we can just rotate the point by the rectangle's angle.
</p>

<div class="org-src-container">
<pre class="src src-lua"><span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #0000FF; font-weight: bold;">function</span> <span style="color: #006699;">QueryPointInRect</span>(<span style="color: #BA36A5;">point</span>: Vector2, rect: S_Rect): boolean
    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">rotated_point</span> = RotatePointAroundPoint(point, rect.origin, rect.angle)
    <span style="color: #0000FF; font-weight: bold;">return</span> QueryPointInAARect(rotated_point, rect)
<span style="color: #0000FF; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd26c2d8" class="outline-4">
<h4 id="orgd26c2d8"><span class="section-number-4">4.3.2.</span> Line in rectangle</h4>
<div class="outline-text-4" id="text-4-3-2">
<p>
We use the same technique as Point in rectangle.
</p>

<div class="org-src-container">
<pre class="src src-lua"><span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #0000FF; font-weight: bold;">function</span> <span style="color: #006699;">QueryLineInRect</span>(<span style="color: #BA36A5;">p1</span>: Vector2, p2: Vector2, rect: S_Rect)
    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">rotated_p1</span> = RotatePointAroundPoint(p1, rect.origin, rect.angle)
    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">rotated_p2</span> = RotatePointAroundPoint(p2, rect.origin, rect.angle)
    <span style="color: #0000FF; font-weight: bold;">return</span> QueryLineInAARect(rotated_p1, rotated_p2, rect)
<span style="color: #0000FF; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org6540b5a" class="outline-4">
<h4 id="org6540b5a"><span class="section-number-4">4.3.3.</span> SAT (Seperating Axis Theorem)</h4>
<div class="outline-text-4" id="text-4-3-3">
<p>
With AABB rectangle in rectangle collision, we checked, for each axis if:
</p>

<div class="org-center">
<p>
min<sub>1</sub> &lt; max<sub>2</sub>
and
max<sub>1</sub> &gt; min<sub>2</sub>
</p>
</div>

<p>
If this is true for both axes, there is a collision. In this section, we will take a closer look at its definition, and implementing it to even work with any convex polygon.
</p>
</div>
</div>
<div id="outline-container-org6ef89c6" class="outline-4">
<h4 id="org6ef89c6"><span class="section-number-4">4.3.4.</span> What is SAT</h4>
<div class="outline-text-4" id="text-4-3-4">
<p>
From <a href="https://en.wikipedia.org/wiki/Hyperplane_separation_theorem#Use_in_collision_detection">Wikipedia</a>:
</p>
<blockquote>
<p>
"Two closed convex objects are disjoint if there exists a line ("separating axis") onto which the two objects' projections are disjoint."
</p>
</blockquote>

<p>
This description "if there exists a line ("separating axis") onto which the two objects' projections are disjoint" may seem familiar. The entire time we have been using SAT. For example, with AABB- AABB collision, we "projected" the x values of our corners onto the x axis, and got the min and max from them. Well, we didn't actually do that in code. Because we already knew what point had the min and what point had the max.
</p>
</div>
</div>
