Docs/Notes.org
*** Implementing SAT

We have two rectangles, R_{1} and R_{2}. We want to find out, using the SAT theorem, if these rectangles collide.

The steps for detecting SAT collision are:
1. Get the normals of the of the two convex shapes.
2. Project the vertices of the two shapes onto the normals.
3. For every projected normal for both shapes, get the min and max projected values of their own projection.
4. Check if there is a seperation between them. If, at any axis (normal) the lines formed by min and max do not connect, then there is no collision.

It sounds complex, and it is, but I will try my best to make it clear. If by the end of this you are still confused, here are some resources that could better visualize SAT.

[1] danielstuts (May 6, 2020). 2D Physics Engine from Scratch (JS) 15: Separating Axis Theorem.
https://www.youtube.com/watch?v=RBya4M6SWwk
[2] Programmer Art. Separating Axis Theorem
https://programmerart.weebly.com/separating-axis-theorem.html

Particularly, the tutorial by Programmer Art is a lot more detailed, and better explained than here. But, it is longer.


Lets start with the first step, which is getting the normals of the rectangle. To get the normal of an edge E = {p_{1}, p_{2}}, you first get the direction vector. This means subtracting the origin (p_{1}).

#+begin_center
V = p_{2} - p_{1}
#+end_center

Then we get the perpendicular vector from V, which gives us N (normal).

#+begin_center
N = (-V.y, V.x)
#+end_center

We do this for the left, right, top, and bottom side of a rectangle.

In Luau:
#+begin_src lua
  -- This will not return an actual normalized (-1, 0, 1) unit vector.
  -- To get the vector normalized, get the .Unit vector from the return value.
  local function GetEdgeNormal(p1: Vector2, p2:Vector2): Vector2
  	-- Direction vector
  	local v = p2 - p1
  	-- Vector perpendicular to V
  	return Vector2.new( -v.Y, v.X)
  end

  -- Return in order:
  -- Top normal
  -- Bottom normal
  -- Left normal
  -- Right normal
  local function GetRectNormals(rect: S_Rect): (Vector2, Vector2, Vector2, Vector2)
  	local tl, tr, bl, br = rect.topLeft, rect.topRight, rect.bottomLeft, rect.bottomRight
  	return
  		GetEdgeNormal(tl, tr),
  		GetEdgeNormal(bl, br),
  		GetEdgeNormal(tl, bl),
  		GetEdgeNormal(tr, br)
  end -- This function is not needed.
#+end_src

Using the logic above, we now have the normals of R_{1}. Now we need to project the corners of both rectangles onto these normals. With AABB rectangles, all we had to do was just use the min and max of the x and the y axes. So how can we get the min and max of our corners along the normal as a single number? The dot product.

#+begin_center
P (Projection) = DotProduct(N, c)
#+end_center

Where x is a corner of our rectangle.

Do this for every corner on a rectangle, and get the min and max of the projections. From there, it is the same as how we checked for intersection with two AABB rectangles, with the only difference being that we check if R_{1} crosses R_{2}, and if R_{2} crosses R_{1}. Similar to what we have done with line segment intersections earlier. If at any axis (normal) they don't cross eachother, then we can return early because there is no collision.

#+begin_src lua
  -- Return the min and max of the corner projection
  local function ProjectRectCorners(p1:  Vector2, p2:  Vector2, p3:  Vector2, p4:  Vector2, projection_vector: Vector2): (number, number)
  	local projection1 = projection_vector:Dot(p1)
  	local projection2 = projection_vector:Dot(p2)
  	local projection3 = projection_vector:Dot(p3)
  	local projection4 = projection_vector:Dot(p4)
  	return
  		math.min(projection1, projection2, projection3, projection4),
  		math.max(projection1, projection2, projection3, projection4)
  end

  local function RectProjectionIntersects(rect1: S_Rect, rect2: S_Rect): boolean
  	-- Top corners
  	local tl1, tr1, tl2, tr2 =
  		rect1.topLeft, rect1.topRight,
  		rect2.topLeft, rect2.topRight
  	-- Bottom corners
  	local bl1, br1, bl2, br2 =
  		rect1.bottomLeft, rect1.bottomRight,
  		rect2.bottomLeft, rect2.bottomRight
  	-- Because there are two parallel lines, we only need two normals from each rect
  	local n1, n2, n3, n4 =
  		-- First rect normals
  		GetEdgeNormal(tl1, tr1),
  		GetEdgeNormal(tl1, br1),
  		-- Second rect normals
  		GetEdgeNormal(tl2, tr2),
  		GetEdgeNormal(tl2, br2)
  	
  	-- Project corners onto rectangle
  	-- rx = rectangle (x)
  	-- px = projection (x)
  	local r1_p1_min, r1_p1_max = ProjectRectCorners(tl1, tr1, bl1, br1, n1)
  	local r2_p1_min, r2_p1_max = ProjectRectCorners(tl2, tr2, bl2, br2, n1)

  	-- Check if it is too far right or too far left to intersect.
  	if  r1_p1_min > r2_p1_max or r1_p1_max < r2_p1_min then
  		return false
  	end
  	
  	-- Rect₁ normal 2
  	local r1_p2_min, r1_p2_max = ProjectRectCorners(tl1, tr1, bl1, br1, n2)
  	local r2_p2_min, r2_p2_max = ProjectRectCorners(tl2, tr2, bl2, br2, n2)

  	if  r1_p2_min > r2_p2_max or r1_p2_max < r2_p2_min then
  		return false
  	end
  	-- Second rect
  	-- Rect₂ normal 1
  	local r1_p3_min, r1_p3_max = ProjectRectCorners(tl1, tr1, bl1, br1, n3)
  	local r2_p3_min, r2_p3_max = ProjectRectCorners(tl2, tr2, bl2, br2, n3)

  	if  r1_p3_min > r2_p3_max or r1_p3_max < r2_p3_min then
  		return false
  	end

  	-- Rect₂ normal 2
  	local r1_p4_min, r1_p4_max = ProjectRectCorners(tl1, tr1, bl1, br1, n4)
  	local r2_p4_min, r2_p4_max = ProjectRectCorners(tl2, tr2, bl2, br2, n4)

  	if  r1_p4_min > r2_p4_max or r1_p4_max < r2_p4_min then
  		return false
  	end
  	-- If all these tests passed, there is a collision 
  	return true
  end
#+end_src


