Docs/Notes.html
<div id="outline-container-org3adc50e" class="outline-4">
<h4 id="org3adc50e"><span class="section-number-4">4.3.5.</span> Implementing SAT</h4>
<div class="outline-text-4" id="text-4-3-5">
<p>
We have two rectangles, R<sub>1</sub> and R<sub>2</sub>. We want to find out, using the SAT theorem, if these rectangles collide.
</p>

<p>
The steps for detecting SAT collision are:
</p>
<ol class="org-ol">
<li>Get the normals of the of the two convex shapes.</li>
<li>Project the vertices of the two shapes onto the normals.</li>
<li>For every projected normal for both shapes, get the min and max projected values of their own projection.</li>
<li>Check if there is a seperation between them. If, at any axis (normal) the lines formed by min and max do not connect, then there is no collision.</li>
</ol>

<p>
It sounds complex, and it is, but I will try my best to make it clear. If by the end of this you are still confused, here are some resources that could better visualize SAT.
</p>

<p>
[1] danielstuts (May 6, 2020). 2D Physics Engine from Scratch (JS) 15: Separating Axis Theorem.
<a href="https://www.youtube.com/watch?v=RBya4M6SWwk">https://www.youtube.com/watch?v=RBya4M6SWwk</a>
[2] Programmer Art. Separating Axis Theorem
<a href="https://programmerart.weebly.com/separating-axis-theorem.html">https://programmerart.weebly.com/separating-axis-theorem.html</a>
</p>

<p>
Particularly, the tutorial by Programmer Art is a lot more detailed, and better explained than here. But, it is longer.
</p>


<p>
Lets start with the first step, which is getting the normals of the rectangle. To get the normal of an edge E = {p<sub>1</sub>, p<sub>2</sub>}, you first get the direction vector. This means subtracting the origin (p<sub>1</sub>).
</p>

<div class="org-center">
<p>
V = p<sub>2</sub> - p<sub>1</sub>
</p>
</div>

<p>
Then we get the perpendicular vector from V, which gives us N (normal).
</p>

<div class="org-center">
<p>
N = (-V.y, V.x)
</p>
</div>

<p>
We do this for the left, right, top, and bottom side of a rectangle.
</p>

<p>
In Luau:
</p>
<div class="org-src-container">
<pre class="src src-lua"><span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">This will not return an actual normalized (-1, 0, 1) unit vector.
</span><span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">To get the vector normalized, get the .Unit vector from the return value.
</span><span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #0000FF; font-weight: bold;">function</span> <span style="color: #006699;">GetEdgeNormal</span>(<span style="color: #BA36A5;">p1</span>: Vector2, p2:Vector2): Vector2
    <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">Direction vector
</span>    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">v</span> = p2 - p1
    <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">Vector perpendicular to V
</span>    <span style="color: #0000FF; font-weight: bold;">return</span> Vector2.new( -v.Y, v.X)
<span style="color: #0000FF; font-weight: bold;">end</span>

<span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">Return in order:
</span><span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">Top normal
</span><span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">Bottom normal
</span><span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">Left normal
</span><span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">Right normal
</span><span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #0000FF; font-weight: bold;">function</span> <span style="color: #006699;">GetRectNormals</span>(<span style="color: #BA36A5;">rect</span>: S_Rect): (Vector2, Vector2, Vector2, Vector2)
    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">tl</span>, <span style="color: #BA36A5;">tr</span>, <span style="color: #BA36A5;">bl</span>, <span style="color: #BA36A5;">br</span> = rect.topLeft, rect.topRight, rect.bottomLeft, rect.bottomRight
    <span style="color: #0000FF; font-weight: bold;">return</span>
        GetEdgeNormal(tl, tr),
        GetEdgeNormal(bl, br),
        GetEdgeNormal(tl, bl),
        GetEdgeNormal(tr, br)
<span style="color: #0000FF; font-weight: bold;">end</span> <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">This function is not needed.</span>
</pre>
</div>

<p>
Using the logic above, we now have the normals of R<sub>1</sub>. Now we need to project the corners of both rectangles onto these normals. With AABB rectangles, all we had to do was just use the min and max of the x and the y axes. So how can we get the min and max of our corners along the normal as a single number? The dot product.
</p>

<div class="org-center">
<p>
P (Projection) = DotProduct(N, c)
</p>
</div>

<p>
Where x is a corner of our rectangle.
</p>

<p>
Do this for every corner on a rectangle, and get the min and max of the projections. From there, it is the same as how we checked for intersection with two AABB rectangles, with the only difference being that we check if R<sub>1</sub> crosses R<sub>2</sub>, and if R<sub>2</sub> crosses R<sub>1</sub>. Similar to what we have done with line segment intersections earlier. If at any axis (normal) they don't cross eachother, then we can return early because there is no collision.
</p>

<div class="org-src-container">
<pre class="src src-lua"><span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">Return the min and max of the corner projection
</span><span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #0000FF; font-weight: bold;">function</span> <span style="color: #006699;">ProjectRectCorners</span>(<span style="color: #BA36A5;">p1</span>:  Vector2, p2:  Vector2, p3:  Vector2, p4:  Vector2, projection_vector: Vector2): (number, number)
    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">projection1</span> = projection_vector:Dot(p1)
    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">projection2</span> = projection_vector:Dot(p2)
    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">projection3</span> = projection_vector:Dot(p3)
    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">projection4</span> = projection_vector:Dot(p4)
    <span style="color: #0000FF; font-weight: bold;">return</span>
        <span style="color: #006FE0;">math</span>.<span style="color: #006FE0;">min</span>(projection1, projection2, projection3, projection4),
        <span style="color: #006FE0;">math</span>.<span style="color: #006FE0;">max</span>(projection1, projection2, projection3, projection4)
<span style="color: #0000FF; font-weight: bold;">end</span>

<span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #0000FF; font-weight: bold;">function</span> <span style="color: #006699;">RectProjectionIntersects</span>(<span style="color: #BA36A5;">rect1</span>: S_Rect, rect2: S_Rect): boolean
    <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">Top corners
</span>    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">tl1</span>, <span style="color: #BA36A5;">tr1</span>, <span style="color: #BA36A5;">tl2</span>, <span style="color: #BA36A5;">tr2</span> =
        rect1.topLeft, rect1.topRight,
        rect2.topLeft, rect2.topRight
    <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">Bottom corners
</span>    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">bl1</span>, <span style="color: #BA36A5;">br1</span>, <span style="color: #BA36A5;">bl2</span>, <span style="color: #BA36A5;">br2</span> =
        rect1.bottomLeft, rect1.bottomRight,
        rect2.bottomLeft, rect2.bottomRight
    <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">Because there are two parallel lines, we only need two normals from each rect
</span>    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">n1</span>, <span style="color: #BA36A5;">n2</span>, <span style="color: #BA36A5;">n3</span>, <span style="color: #BA36A5;">n4</span> =
        <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">First rect normals
</span>        GetEdgeNormal(tl1, tr1),
        GetEdgeNormal(tl1, br1),
        <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">Second rect normals
</span>        GetEdgeNormal(tl2, tr2),
        GetEdgeNormal(tl2, br2)

    <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">Project corners onto rectangle
</span>    <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">rx = rectangle (x)
</span>    <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">px = projection (x)
</span>    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">r1_p1_min</span>, <span style="color: #BA36A5;">r1_p1_max</span> = ProjectRectCorners(tl1, tr1, bl1, br1, n1)
    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">r2_p1_min</span>, <span style="color: #BA36A5;">r2_p1_max</span> = ProjectRectCorners(tl2, tr2, bl2, br2, n1)

    <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">Check if it is too far right or too far left to intersect.
</span>    <span style="color: #0000FF; font-weight: bold;">if</span>  r1_p1_min &gt; r2_p1_max <span style="color: #0000FF; font-weight: bold;">or</span> r1_p1_max &lt; r2_p1_min <span style="color: #0000FF; font-weight: bold;">then</span>
        <span style="color: #0000FF; font-weight: bold;">return</span> <span style="color: #D0372D;">false</span>
    <span style="color: #0000FF; font-weight: bold;">end</span>

    <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">Rect&#8321; normal 2
</span>    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">r1_p2_min</span>, <span style="color: #BA36A5;">r1_p2_max</span> = ProjectRectCorners(tl1, tr1, bl1, br1, n2)
    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">r2_p2_min</span>, <span style="color: #BA36A5;">r2_p2_max</span> = ProjectRectCorners(tl2, tr2, bl2, br2, n2)

    <span style="color: #0000FF; font-weight: bold;">if</span>  r1_p2_min &gt; r2_p2_max <span style="color: #0000FF; font-weight: bold;">or</span> r1_p2_max &lt; r2_p2_min <span style="color: #0000FF; font-weight: bold;">then</span>
        <span style="color: #0000FF; font-weight: bold;">return</span> <span style="color: #D0372D;">false</span>
    <span style="color: #0000FF; font-weight: bold;">end</span>
    <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">Second rect
</span>    <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">Rect&#8322; normal 1
</span>    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">r1_p3_min</span>, <span style="color: #BA36A5;">r1_p3_max</span> = ProjectRectCorners(tl1, tr1, bl1, br1, n3)
    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">r2_p3_min</span>, <span style="color: #BA36A5;">r2_p3_max</span> = ProjectRectCorners(tl2, tr2, bl2, br2, n3)

    <span style="color: #0000FF; font-weight: bold;">if</span>  r1_p3_min &gt; r2_p3_max <span style="color: #0000FF; font-weight: bold;">or</span> r1_p3_max &lt; r2_p3_min <span style="color: #0000FF; font-weight: bold;">then</span>
        <span style="color: #0000FF; font-weight: bold;">return</span> <span style="color: #D0372D;">false</span>
    <span style="color: #0000FF; font-weight: bold;">end</span>

    <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">Rect&#8322; normal 2
</span>    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">r1_p4_min</span>, <span style="color: #BA36A5;">r1_p4_max</span> = ProjectRectCorners(tl1, tr1, bl1, br1, n4)
    <span style="color: #0000FF; font-weight: bold;">local</span> <span style="color: #BA36A5;">r2_p4_min</span>, <span style="color: #BA36A5;">r2_p4_max</span> = ProjectRectCorners(tl2, tr2, bl2, br2, n4)

    <span style="color: #0000FF; font-weight: bold;">if</span>  r1_p4_min &gt; r2_p4_max <span style="color: #0000FF; font-weight: bold;">or</span> r1_p4_max &lt; r2_p4_min <span style="color: #0000FF; font-weight: bold;">then</span>
        <span style="color: #0000FF; font-weight: bold;">return</span> <span style="color: #D0372D;">false</span>
    <span style="color: #0000FF; font-weight: bold;">end</span>
    <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">If all these tests passed, there is a collision 
</span>    <span style="color: #0000FF; font-weight: bold;">return</span> <span style="color: #D0372D;">true</span>
<span style="color: #0000FF; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
</div>
</div>
